hbalint2100/STM32_PongBreakout/src/main.c
#include "stm32f4xx_hal.h"
#include "display.h"
#include "gyro.h"
#include "ball.h"
#include <stdio.h>
#include "stm32f429i_discovery.h"

static void SystemClock_Config(void);

int main()
{
    HAL_Init();
    SystemClock_Config();
    __HAL_DBGMCU_FREEZE_IWDG();
    BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
    displayInit();
    gyroInit();
    menu();
    HAL_Delay(200);
    ball ball;
    initBall(&ball);
    int8_t x, y;
    while (1)
    {
        if(HAL_GetTick()%2==0)
        {
            drawBall(ball);
            stepBall(&ball);
        }
        getXYFromGyro(&x,&y);
        applyForce(&ball,(coordinate){x,y});
        if(BSP_PB_GetState(BUTTON_KEY)!=RESET)
        {
            break;
        }
    }
    printMsg("PRESS RESET");
}

static void SystemClock_Config(void)
{
    RCC_ClkInitTypeDef RCC_ClkInitStruct;
    RCC_OscInitTypeDef RCC_OscInitStruct;

    /* Enable Power Control clock */
    __HAL_RCC_PWR_CLK_ENABLE();
    
    /* The voltage scaling allows optimizing the power consumption when the device is 
        clocked below the maximum system frequency, to update the voltage scaling value 
        regarding system frequency refer to product datasheet.  */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
    
    /* Enable HSE Oscillator and activate PLL with HSE as source */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 8;
    RCC_OscInitStruct.PLL.PLLN = 360;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = 7;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /* Activate the Over-Drive mode */
    HAL_PWREx_EnableOverDrive();
        
    /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
        clocks dividers */
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;  
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;  
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
}

void SysTick_Handler(void)
{
    HAL_IncTick();
}